{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Flatten",
          "config": { "name": "flatten_1", "trainable": true }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "name": "dense_1",
            "trainable": true
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [150528, 4], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [4], "dtype": "float32" }
      ]
    }
  ]
}
